//@strict-types

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ПересчетСуммы(ТекущиеДанныеТовары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ПересчетСуммы(ТекущиеДанныеТовары);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Процедура производит пересчет Суммы в ТЧ Товары.
//
// Параметры:
//  ТекущиеДанныеТовары - ДанныеФормыЭлементКоллекции - ТекущиеДанные ТЧ Товары
//
&НаКлиенте
Процедура ПересчетСуммы(ТекущиеДанныеТовары)
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Цена * ТекущиеДанныеТовары.Количество;	
КонецПроцедуры
#КонецОбласти